In [1]:
import pandas as pd

In [7]:
file_path = 'Student_scores.xlsx'
df = pd.read_excel(r'C:\Users\dawar\OneDrive\Desktop\jupyterproject\student_scores.xlsx')

In [8]:
df['Total'] = df[['Math', 'English', 'Science']].sum(axis=1)
df['Percentage'] = (df['Total'] / 3).round(2)  # Assuming 3 subjects

In [9]:
print(df[['Name', 'Math', 'English', 'Science', 'Total', 'Percentage']])

       Name  Math  English  Science  Total  Percentage
0  Student1    85       90       88    263       87.67
1  Student2    78       85       92    255       85.00
2  Student3    92       88       78    258       86.00
3  Student4    89       94       87    270       90.00
4  Student5    76       82       90    248       82.67

In [10]:
output_file = 'marksheet.xlsx'
df.to_excel(output_file, index=False)

In [14]:
excel_file = "Student_scores.xlsx"
df = pd.read_excel(r'C:\Users\dawar\OneDrive\Desktop\jupyterproject\student_scores.xlsx')

print("Initial DataFrame:")
print(df)


df['Total'] = df.iloc[:, 1:].sum(axis=1)
df['Average'] = df.iloc[:, 1:].mean(axis=1)

Initial DataFrame:
       Name  Math  English  Science
0  Student1    85       90       88
1  Student2    78       85       92
2  Student3    92       88       78
3  Student4    89       94       87
4  Student5    76       82       90

In [21]:
file_path = 'student_scores.xlsx'
df = pd.read_excel(r'C:\Users\dawar\OneDrive\Desktop\jupyterproject\student_scores.xlsx')
print("Original DataFrame:")
print(df)
name_column = df['Name']
math_column = df['Math']
english_column = df['English']
science_column = df['Science']
print("\nSeparated Columns:")
print("Name Column:")
print(name_column)
print("\nMath Column:")
print(math_column)
print("\nEnglish Column:")
print(english_column)
print("\nScience Column:")
print(science_column)

Original DataFrame:
       Name  Math  English  Science
0  Student1    85       90       88
1  Student2    78       85       92
2  Student3    92       88       78
3  Student4    89       94       87
4  Student5    76       82       90

Separated Columns:
Name Column:
0    Student1
1    Student2
2    Student3
3    Student4
4    Student5
Name: Name, dtype: object

Math Column:
0    85
1    78
2    92
3    89
4    76
Name: Math, dtype: int64

English Column:
0    90
1    85
2    88
3    94
4    82
Name: English, dtype: int64

Science Column:
0    88
1    92
2    78
3    87
4    90
Name: Science, dtype: int64

In [36]:
pd.read_excel("Student_scores.xlsx")

       Name  Math  English  Science
0  Student1    85       90       88
1  Student2    78       85       92
2  Student3    92       88       78
3  Student4    89       94       87
4  Student5    76       82       90

In [1]:
import pandas as pd

def update_student_scores(file_path):
    try:
        df = pd.read_excel(file_path)
    except FileNotFoundError:
        
        df = pd.DataFrame(columns=['Name', 'Math', 'English', 'Science'])

    print("Current Data:")
    print(df)

    while True:
    
        try:
            name = input("Enter student's name (or 'q' to quit): ")
            if name.lower() == 'q':
                break  

            math_score = float(input("Enter Math score for {}: ".format(name)))
            english_score = float(input("Enter English score for {}: ".format(name)))
            science_score = float(input("Enter Science score for {}: ".format(name)))
        except ValueError:
            print("Invalid input. Please enter numbers for scores.")
            continue 

       
        new_data = {'Name': [name], 'Math': [math_score], 'English': [english_score], 'Science': [science_score]}

       
        df = pd.concat([df, pd.DataFrame(new_data)], ignore_index=True)

        print("\nUpdated Data:")
        print(df)

    
    if len(df) > len(pd.read_excel(file_path)):  
        df.to_excel(file_path, index=False)
        print("\nData saved successfully to {}".format(file_path))

if __name__ == "__main__":
    
    excel_file_path = 'Student_scores.xlsx'
    update_student_scores(excel_file_path)

Current Data:
       Name  Math  English  Science
0  Student1    85       90       88
1  Student2    78       85       92
2  Student3    92       88       78
3  Student4    89       94       87
4  Student5    76       82       90
5    parvez    92       95       98
6   charwak    90       80       95
Enter student's name (or 'q' to quit): Abhi
Enter Math score for Abhi: 85
Enter English score for Abhi: 95
Enter Science score for Abhi: 75

Updated Data:
       Name  Math  English  Science
0  Student1  85.0     90.0     88.0
1  Student2  78.0     85.0     92.0
2  Student3  92.0     88.0     78.0
3  Student4  89.0     94.0     87.0
4  Student5  76.0     82.0     90.0
5    parvez  92.0     95.0     98.0
6   charwak  90.0     80.0     95.0
7      Abhi  85.0     95.0     75.0
Enter student's name (or 'q' to quit): q

Data saved successfully to Student_scores.xlsx

In [5]:
pd.read_excel("Student_scores.xlsx")

       Name  Math  English  Science
0  Student1    85       90       88
1  Student2    78       85       92
2  Student3    92       88       78
3  Student4    89       94       87
4  Student5    76       82       90
5    parvez    92       95       98
6   charwak    90       80       95
7      Abhi    85       95       75